[Survived] StringLiteral
stryker-fun/stryker-test/src/serviceWorker.js:85:27
               // At this point, everything has been precached.
               // It's the perfect time to display a
               // "Content is cached for offline use." message.
-              console.log('Content is cached for offline use.');
+              console.log("");
 
               // Execute callback

[Survived] StringLiteral
stryker-fun/stryker-test/src/serviceWorker.js:104:16
 function checkValidServiceWorker(swUrl, config) {
   // Check if the service worker can be found. If it can't reload the page.
   fetch(swUrl, {
-    headers: { 'Service-Worker': 'script' },
+    headers: { "": 'script' },
   })
     .then(response => {

[Survived] EqualityOperator
stryker-fun/stryker-test/src/serviceWorker.js:111:10
       const contentType = response.headers.get('content-type');
       if (
         response.status === 404 ||
-        (contentType != null && contentType.indexOf('javascript') === -1)
+        (contentType == null && contentType.indexOf('javascript') === -1)
       ) {
         // No service worker found. Probably a different app. Reload the page.

[Survived] UnaryOperator
stryker-fun/stryker-test/src/serviceWorker.js:111:71
       const contentType = response.headers.get('content-type');
       if (
         response.status === 404 ||
-        (contentType != null && contentType.indexOf('javascript') === -1)
+        (contentType != null && contentType.indexOf('javascript') === +1)
       ) {
         // No service worker found. Probably a different app. Reload the page.

[Survived] BlockStatement
stryker-fun/stryker-test/src/serviceWorker.js:131:30
     });
 }
 
-export function unregister() {
-  if ('serviceWorker' in navigator) {
-    navigator.serviceWorker.ready
-      .then(registration => {
-        registration.unregister();
-      })
-      .catch(error => {
-        console.error(error.message);
-      });
-  }
-}
+export function unregister() {}
 

[Survived] BlockStatement
stryker-fun/stryker-test/src/serviceWorker.js:134:29
 export function unregister() {
   if ('serviceWorker' in navigator) {
     navigator.serviceWorker.ready
-      .then(registration => {
-        registration.unregister();
-      })
+      .then(registration => {})
       .catch(error => {
         console.error(error.message);

[Survived] BlockStatement
stryker-fun/stryker-test/src/serviceWorker.js:137:23
       .then(registration => {
         registration.unregister();
       })
-      .catch(error => {
-        console.error(error.message);
-      });
+      .catch(error => {});
   }
 }
